# Kiarash Geraili, Computer Science student at AmirKabir University of TechnologyÂ¶
# Third Section: Pandas
# Based on a Data Mining Course By Adel Mohammadpour
# Teaching Assistant: Vahid Mahzoon

In [19]:
import pandas as pd
import numpy as np

!pip install update pandas
#Pandas is the most popular python library that is used for data analysis. 
#It provides highly optimized performance with back-end source code is purely written in C or Python like numpy
#Pandas also provides some Data Structures (DS) which are very useful like series, Dataframes.

Requirement already satisfied: update in c:\users\admin\anaconda3\lib\site-packages (0.0.1)
Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.0.3)
Requirement already satisfied: style==1.1.0 in c:\users\admin\anaconda3\lib\site-packages (from update) (1.1.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

# Series

In [6]:
# Series can only contain a single list with index, 
# whereas dataframe can be made of more than one series
# or we can say that a dataframe is a collection of series that can be used to analyze the data.
# series DS tags data automatically
Authors = ['Ernest Hemingway','Theodor Adorno','Socrates','James Joyce']

pd.Series(data = Authors)

0    Ernest Hemingway
1      Theodor Adorno
2            Socrates
3         James Joyce
dtype: object

In [12]:
# we can also change the index of a series using a specific label:

label = ['Novelist','Philosopher','Philosopher','Novelist']

pd.Series(data = Authors, index = label)

Novelist       Ernest Hemingway
Philosopher      Theodor Adorno
Philosopher            Socrates
Novelist            James Joyce
dtype: object

In [15]:
array = np.array(Authors) 
pd.Series(array)

# creating a series using an array is similar to creating a series using a list

0    Ernest Hemingway
1      Theodor Adorno
2            Socrates
3         James Joyce
dtype: object

In [18]:
Dict = {'Ernest Hemingway':1 ,'Theodor Adorno':2 ,'Socrates':3 ,'James Joyce':4}
pd.Series(Dict)

# we can also create a series using a dictionary

Ernest Hemingway    1
Theodor Adorno      2
Socrates            3
James Joyce         4
dtype: int64

In [20]:
# we can also create a series with functions as the elements:
import math

pd.Series([sum, len, print, math.sqrt, math.sin])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
3     <built-in function sqrt>
4      <built-in function sin>
dtype: object

# Values , Indexes

In [24]:
# another way of creating a series:

Covid19_ptns_Serie = pd.Series([100, 200, 23000, 1000, 10000, 8000],['cuba', 'inonesia', 'USA', 'Uk', 'China', 'Iran'])
Covid19_ptns_Serie

cuba          100
inonesia      200
USA         23000
Uk           1000
China       10000
Iran         8000
dtype: int64

In [25]:
Covid19_ptns_Serie.index

Index(['cuba', 'inonesia', 'USA', 'Uk', 'China', 'Iran'], dtype='object')

In [29]:
# chaging the index:
Covid19_ptns_Serie.index = ['Vietnam', 'Germany', 'Italy', 'Spania', 'Canada', 'Egypt']
Covid19_ptns_Serie

Vietnam      100
Germany      200
Italy      23000
Spania      1000
Canada     10000
Egypt       8000
dtype: int64

In [30]:
Covid19_ptns_Serie['Italy']

23000

In [32]:
Covid19_ptns_Serie.Italy

# as you can see we can use both ways to access to an element

23000

In [33]:
# conditional selection on rows:

Covid19_ptns_Serie > 800

# it returns a series of booleans that indicates which elements satisfied the condition

Vietnam    False
Germany    False
Italy       True
Spania      True
Canada      True
Egypt       True
dtype: bool

In [34]:
Covid19_ptns_Serie[Covid19_ptns_Serie > 800]

# returns a series that contains all elements in which satisfied the condition:

Italy     23000
Spania     1000
Canada    10000
Egypt      8000
dtype: int64

# DataFrame

In [2]:
# DataFrame is a two-dimensional size-mutable,
# potentially heterogeneous tabular data structure with labeled axes (rows and columns). 
# A Data frame is a two-dimensional data structure; i.e., data is aligned in a tabular fashion in rows and columns.
# notice we can consider each column as a series!

Columns = 'First_Name Sex Profession WorkName'.split()
Columns

['First_Name', 'Sex', 'Profession', 'WorkName']

In [3]:
index = 'Freud Benjamin Bronte Woolf Fellini Noe'.split()
index

['Freud', 'Benjamin', 'Bronte', 'Woolf', 'Fellini', 'Noe']

In [76]:
DF = pd.DataFrame(np.random.randint(0,100,(6,4)), index, Columns)
DF
# using random variables for creating a DataFrame

          First_Name  Sex  Profession  WorkName
Freud             78   51          76        91
Benjamin          13    7          14        47
Bronte            11   74          69        68
Woolf             77   68           3        99
Fellini           70   92          80        83
Noe               35   15           7        49

In [55]:
# we want to fill our DataFrame so for each index we have four column:

List_DataFrame = [['Sigmund', 'M', 'Psychoanalysis', 'The Interpretation of Dreams'],['Walter', 'M', 'Philosopher', 'The Work of Art in the Age of Mechanical Reproduction']
,['Charlotte', 'F', 'Novelist', 'Jane Eyre'],['Virginia', 'F', 'Novelist', 'A Room of One\'s Own']
,['Federico', 'M', 'Director', 'Eight and a half'],['Gaspar', 'M', 'Director', 'Irreversible']]

pd.DataFrame(List_DataFrame, index, Columns)

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,F,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,Irreversible

In [5]:
#Creating a DataFrame using a Dictionary:

Dict = {
    'Freud' : ['Sigmund', 'M', 'Psychoanalysis', 'The Interpretation of Dreams'],
    'Benjamin' : ['Walter', 'M', 'Philosopher', 'The Work of Art in the Age of Mechanical Reproduction'],
    'Bronte' : ['Charlotte', 'F', 'Novelist', 'Jane Eyre'],
    'Woolf' : ['Virginia', 'F', 'Novelist', 'A Room of One\'s Own'],
    'Fellini' : ['Federico', 'M', 'Director', 'Eight and a half'],
    'Noe' :['Gaspar', 'M', 'Director', 'Irreversible']
}

df = pd.DataFrame(Dict.values() ,Dict.keys(), Columns)
df

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,F,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,Irreversible

In [85]:
df.columns

Index(['First_Name', 'Sex', 'Profession', 'WorkName'], dtype='object')

In [86]:
df.index

Index(['Freud', 'Benjamin', 'Bronte', 'Woolf', 'Fellini', 'Noe'], dtype='object')

In [89]:
df.values

array([['Sigmund', 'M', 'Psychoanalysis', 'The Interpretation of Dreams'],
       ['Walter', 'M', 'Philosopher',
        'The Work of Art in the Age of Mechanical Reproduction'],
       ['Charlotte', 'F', 'Novelist', 'Jane Eyre'],
       ['Virginia', 'F', 'Novelist', "A Room of One's Own"],
       ['Federico', 'M', 'Director', 'Eight and a half'],
       ['Gaspar', 'M', 'Director', 'Irreversible']], dtype=object)

# Values, Indexes

In [94]:
df[['Profession', 'First_Name']]

              Profession First_Name
Freud     Psychoanalysis    Sigmund
Benjamin     Philosopher     Walter
Bronte          Novelist  Charlotte
Woolf           Novelist   Virginia
Fellini         Director   Federico
Noe             Director     Gaspar

In [6]:
DF = pd.DataFrame(np.random.randint(0,100,(6,4)), index, Columns)
DF

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9
Noe                1   32          69        82

In [43]:
# We can add or subtract a column (or a series) in a DataFrame to\from another one and add it directly to DataFrame:

df1 = DF
df1['Unknown'] = DF['First_Name'] -  DF['WorkName']
df1

          First_Name  Sex  Profession  WorkName  Unknown
Freud             16   89          48        55      -39
Benjamin          64   41          77        72       -8
Bronte            46   69          40        47       -1
Woolf             56   68          67        67      -11
Fellini           90   80          53         9       81
Noe                1   32          69        82      -81

In [35]:
# drop() can remove a column from a DataFrame but notice that it does not delete the column:
#(notice that axis = 1 indicates that we are talking about columns)

df1.drop('Unknown', axis = 1)

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9
Noe                1   32          69        82

In [36]:
df1
#as you can see we still do not delete Unknown column

          First_Name  Sex  Profession  WorkName  Unknown
Freud             16   89          48        55      -39
Benjamin          64   41          77        72       -8
Bronte            46   69          40        47       -1
Woolf             56   68          67        67      -11
Fellini           90   80          53         9       81
Noe                1   32          69        82      -81

In [44]:
# using inplace argument we can decide that we want the dropped column or not

df1.drop('Unknown', axis = 1, inplace = True)
df1

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9
Noe                1   32          69        82

In [42]:
# all are the same for rows (except that axis value should be equal to zero when we talk about rows):

df1.drop('Noe')

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9

In [39]:
df1

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9
Noe                1   32          69        82

In [46]:
df1.drop('Noe', axis = 0, inplace = True)
df1

          First_Name  Sex  Profession  WorkName
Freud             16   89          48        55
Benjamin          64   41          77        72
Bronte            46   69          40        47
Woolf             56   68          67        67
Fellini           90   80          53         9

# Selection

In [49]:
Dict = {
    'Freud' : ['Sigmund', 'M', 'Psychoanalysis', 'The Interpretation of Dreams'],
    'Benjamin' : ['Walter', 'M', 'Philosopher', 'The Work of Art in the Age of Mechanical Reproduction'],
    'Bronte' : ['Charlotte', 'F', 'Novelist', 'Jane Eyre'],
    'Woolf' : ['Virginia', 'F', 'Novelist', 'A Room of One\'s Own'],
    'Fellini' : ['Federico', 'M', 'Director', 'Eight and a half'],
    'Noe' :['Gaspar', 'M', 'Director', 'Irreversible']
}

df = pd.DataFrame(Dict.values() ,Dict.keys(), Columns)
df

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,F,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,Irreversible

In [50]:
df.loc['Benjamin']

First_Name                                               Walter
Sex                                                           M
Profession                                          Philosopher
WorkName      The Work of Art in the Age of Mechanical Repro...
Name: Benjamin, dtype: object

In [51]:
df.iloc[2]

First_Name    Charlotte
Sex                   F
Profession     Novelist
WorkName      Jane Eyre
Name: Bronte, dtype: object

In [52]:
df.loc['Freud','WorkName']

'The Interpretation of Dreams'

In [54]:
df.loc[['Freud','Woolf'],['WorkName','Sex']]

                           WorkName Sex
Freud  The Interpretation of Dreams   M
Woolf           A Room of One's Own   F

In [55]:
df[df == 'Novelist']

         First_Name  Sex Profession WorkName
Freud           NaN  NaN        NaN      NaN
Benjamin        NaN  NaN        NaN      NaN
Bronte          NaN  NaN   Novelist      NaN
Woolf           NaN  NaN   Novelist      NaN
Fellini         NaN  NaN        NaN      NaN
Noe             NaN  NaN        NaN      NaN

In [56]:
df[df['Sex'] == 'F']

       First_Name Sex Profession             WorkName
Bronte  Charlotte   F   Novelist            Jane Eyre
Woolf    Virginia   F   Novelist  A Room of One's Own

In [57]:
df[df['Profession'] == 'Director']['Sex']

Fellini    M
Noe        M
Name: Sex, dtype: object

In [60]:
df[df['Profession'] == 'Novelist'][['Sex','WorkName']]

       Sex             WorkName
Bronte   F            Jane Eyre
Woolf    F  A Room of One's Own

In [61]:
df.reset_index()
#we can reset index to default state

,index,First_Name,Sex,Profession,WorkName
0,Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
1,Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
2,Bronte,Charlotte,F,Novelist,Jane Eyre
3,Woolf,Virginia,F,Novelist,A Room of One's Own
4,Fellini,Federico,M,Director,Eight and a half
5,Noe,Gaspar,M,Director,Irreversible

# Operations

In [78]:
d = {'col1': [1, 202, 0.1], 'col2': [31, 4, -12], 'col3': [11, 13, 1000]}
ind =['element1','element2', 'element3']

df = pd.DataFrame(data=d, index = ind)
df

           col1  col2  col3
element1    1.0    31    11
element2  202.0     4    13
element3    0.1   -12  1000

In [85]:
df['col4'] = ['a','b','c']
df.set_index('col4')

# adding a column to the end of the DataFrame and then changing the indexes by columns that added

       col1  col2  col3
col4
a       1.0    31    11
b     202.0     4    13
c       0.1   -12  1000

In [101]:
df = pd.DataFrame(Dict.values(),Dict.keys(),Columns)
df

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,F,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,Irreversible

In [104]:
# this function returns unique values of a column 

df['Profession'].unique()

array(['Psychoanalysis', 'Philosopher', 'Novelist', 'Director'],
      dtype=object)

In [109]:
# nunique() returns the number of unique values in a column

print(df['Sex'].nunique() , df['First_Name'].nunique())

2 6

In [111]:
df['Profession'].value_counts()

# gets us a Series containing counts of unique values.

Novelist          2
Director          2
Philosopher       1
Psychoanalysis    1
Name: Profession, dtype: int64

# Apllying Functions to DataFrame

In [150]:
df = pd.DataFrame(data=d, index = ind)

# applying a function to multiply all elements of colomn number one to 1/2
df['col1'] = [item/2 for item in df['col1']]
df

            col1  col2  col3
element1    0.50    31    11
element2  101.00     4    13
element3    0.05   -12  1000

In [130]:
# this is another practical way of applying a function:

import math
def function(x):
    return math.sqrt(x)

df['col3'].apply(function)

element1     3.316625
element2     3.605551
element3    31.622777
Name: col3, dtype: float64

In [131]:
df

            col1  col2  col3
element1    0.50    31    11
element2  101.00     4    13
element3    0.05   -12  1000

In [132]:
df['col3'] = df['col3'].apply(function)
df

            col1  col2       col3
element1    0.50    31   3.316625
element2  101.00     4   3.605551
element3    0.05   -12  31.622777

In [137]:
df['col4'] = ['Kiarash','John','Peter Parker']
print(df)

df['col4'].apply(len)

            col1  col2       col3          col4
element1    0.50    31   3.316625       Kiarash
element2  101.00     4   3.605551          John
element3    0.05   -12  31.622777  Peter Parker

element1     7
element2     4
element3    12
Name: col4, dtype: int64

In [138]:
df['col1'].sum()

#summation on all elements of a column

101.55

In [141]:
# sorting function Sorts by the values along either axis.

df.sort_values(by = 'col1')

            col1  col2       col3          col4
element3    0.05   -12  31.622777  Peter Parker
element1    0.50    31   3.316625       Kiarash
element2  101.00     4   3.605551          John

In [142]:
df.sort_values(by = 'col4')

            col1  col2       col3          col4
element2  101.00     4   3.605551          John
element1    0.50    31   3.316625       Kiarash
element3    0.05   -12  31.622777  Peter Parker

In [145]:
df.sort_values(by = 'col2', ascending = False)

#Sort ascending vs. descending based on a boolean

            col1  col2       col3          col4
element1    0.50    31   3.316625       Kiarash
element2  101.00     4   3.605551          John
element3    0.05   -12  31.622777  Peter Parker

# Null Values

In [156]:
df = pd.DataFrame(Dict.values(),Dict.keys(),Columns)
df

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,M,Psychoanalysis,The Interpretation of Dreams
Benjamin,Walter,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,F,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,Irreversible

In [159]:
df.loc['Freud','Sex'] = np.NAN
df.loc['Benjamin','First_Name'] = np.NAN
df.loc['Noe','WorkName'] = np.NAN
df.loc['Woolf','Sex'] = np.NAN
df
# Assume that in a data set we have some missing values

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,NaN,Psychoanalysis,The Interpretation of Dreams
Benjamin,NaN,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,NaN,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,NaN

In [160]:
df.isnull()
#finding null values

          First_Name    Sex  Profession  WorkName
Freud          False   True       False     False
Benjamin        True  False       False     False
Bronte         False  False       False     False
Woolf          False   True       False     False
Fellini        False  False       False     False
Noe            False  False       False      True

In [161]:
df.dropna()
# this function delete rows that have missing (null) features or elements
# it is trivial that as usually finding data is a hard process, therefore,
# deleting some data due to a missing value is not professional indeed!

        First_Name Sex Profession          WorkName
Bronte   Charlotte   F   Novelist         Jane Eyre
Fellini   Federico   M   Director  Eight and a half

In [162]:
df

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,NaN,Psychoanalysis,The Interpretation of Dreams
Benjamin,NaN,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,NaN,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,NaN

In [164]:
df.dropna(axis = 1)

              Profession
Freud     Psychoanalysis
Benjamin     Philosopher
Bronte          Novelist
Woolf           Novelist
Fellini         Director
Noe             Director

In [166]:
# we can also fill missing values using an arbitrary value

df.fillna('MISSING')

,First_Name,Sex,Profession,WorkName
Freud,Sigmund,MISSING,Psychoanalysis,The Interpretation of Dreams
Benjamin,MISSING,M,Philosopher,The Work of Art in the Age of Mechanical Repro...
Bronte,Charlotte,F,Novelist,Jane Eyre
Woolf,Virginia,MISSING,Novelist,A Room of One's Own
Fellini,Federico,M,Director,Eight and a half
Noe,Gaspar,M,Director,MISSING

# CSV  Input

In [168]:
# CSV (comma-separated value) files are a standard file format for transferring and storing data. 
#The ability to read, manipulate, and write data to and from CSV files using Python 
#is a key skill to master for any data scientist or business analysis.

In [174]:
# this is how we read data from file 'filename.csv' 
# (notice that you should the file should be in the same directory that your python process is based)
# So you download the repository from my git hub account you can find a file named: USA_Housing 

data = pd.read_csv("USA_Housing.csv")
data

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386
...,...,...,...,...,...,...,...
4995,60567.944140,7.830362,6.137356,3.46,22837.361035,1.060194e+06,USNS Williams\nFPO AP 30153-7653
4996,78491.275435,6.999135,6.576763,4.02,25616.115489,1.482618e+06,"PSC 9258, Box 8489\nAPO AA 42991-3352"
4997,63390.686886,7.250591,4.805081,2.13,33266.145490,1.030730e+06,"4215 Tracy Garden Suite 076\nJoshualand, VA 01..."
4998,68001.331235,5.534388,7.130144,5.44,42625.620156,1.198657e+06,USS Wallace\nFPO AE 73316
4999,65510.581804,5.992305,6.792336,4.07,46501.283803,1.298950e+06,"37778 George Ridges Apt. 509\nEast Holly, NV 2..."

In [177]:
data.head(6)
# This function returns the first n rows for the object based on position.

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386
5,80175.754159,4.988408,6.104512,4.04,26748.428425,1.068138e+06,"06039 Jennifer Islands Apt. 443\nTracyport, KS..."

In [178]:
data.info
# function is used to get a concise summary of the dataframe.
# It comes really handy when doing exploratory analysis of the data
# also there are some important values like average which you can see using this function

<bound method DataFrame.info of       Avg. Area Income  Avg. Area House Age  Avg. Area Number of Rooms  \
0         79545.458574             5.682861                   7.009188
1         79248.642455             6.002900                   6.730821
2         61287.067179             5.865890                   8.512727
3         63345.240046             7.188236                   5.586729
4         59982.197226             5.040555                   7.839388
...                ...                  ...                        ...
4995      60567.944140             7.830362                   6.137356
4996      78491.275435             6.999135                   6.576763
4997      63390.686886             7.250591                   4.805081
4998      68001.331235             5.534388                   7.130144
4999      65510.581804             5.992305                   6.792336

      Avg. Area Number of Bedrooms  Area Population         Price  \
0                             4.09     23086.800503  1.059034e+06
1                             3.09     40173.072174  1.505891e+06
2                             5.13     36882.159400  1.058988e+06
3                             3.26     34310.242831  1.260617e+06
4                             4.23     26354.109472  6.309435e+05
...                            ...              ...           ...
4995                          3.46     22837.361035  1.060194e+06
4996                          4.02     25616.115489  1.482618e+06
4997                          2.13     33266.145490  1.030730e+06
4998                          5.44     42625.620156  1.198657e+06
4999                          4.07     46501.283803  1.298950e+06

                                                Address
0     208 Michael Ferry Apt. 674\nLaurabury, NE 3701...
1     188 Johnson Views Suite 079\nLake Kathleen, CA...
2     9127 Elizabeth Stravenue\nDanieltown, WI 06482...
3                             USS Barnett\nFPO AP 44820
4                            USNS Raymond\nFPO AE 09386
...                                                 ...
4995                   USNS Williams\nFPO AP 30153-7653
4996              PSC 9258, Box 8489\nAPO AA 42991-3352
4997  4215 Tracy Garden Suite 076\nJoshualand, VA 01...
4998                          USS Wallace\nFPO AE 73316
4999  37778 George Ridges Apt. 509\nEast Holly, NV 2...

[5000 rows x 7 columns]>

In [180]:
data.describe()
# returns minimum, maximum, mean, median, standard deviation,... of data

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5.000000e+03
mean,68583.108984,5.977222,6.987792,3.981330,36163.516039,1.232073e+06
std,10657.991214,0.991456,1.005833,1.234137,9925.650114,3.531176e+05
min,17796.631190,2.644304,3.236194,2.000000,172.610686,1.593866e+04
25%,61480.562388,5.322283,6.299250,3.140000,29403.928702,9.975771e+05
50%,68804.286404,5.970429,7.002902,4.050000,36199.406689,1.232669e+06
75%,75783.338666,6.650808,7.665871,4.490000,42861.290769,1.471210e+06
max,107701.748378,9.519088,10.759588,6.500000,69621.713378,2.469066e+06

# HTML Input

In [181]:
# we can read an HTML table with pd.read_html
# for example we want to read data from an html page like this one: https://www.fdic.gov/bank/individual/failed/banklist.html

df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
df

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [184]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [190]:
# as our teacher assistant recommended us, I also highly recommend you  
# to use https://towardsdatascience.com/ to find out some up to date works
# that data scientists are doing at the moment. it also helps you to find out the potential of this field of study
# and in some cases reading other researchers works illustrates that you are interested in which part of data science
# that surely could be useful.